/*
MySQL Data Transfer
Source Host: localhost
Source Database: lineage
Target Host: localhost
Target Database: lineage
Date: 2014-7-15 11:08:41
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for skill_list
-- ----------------------------
CREATE TABLE `skill_list` (
  `skill_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL DEFAULT '',
  `skill_level` int(10) NOT NULL DEFAULT '0',
  `skill_no` int(10) NOT NULL DEFAULT '0',
  `magic` enum('pc','npc') NOT NULL DEFAULT 'pc',
  `mp_consume` int(10) unsigned NOT NULL DEFAULT '0',
  `hp_consume` int(10) unsigned NOT NULL DEFAULT '0',
  `item_consume` int(10) unsigned NOT NULL DEFAULT '0',
  `item_consume_count` int(10) unsigned NOT NULL DEFAULT '0',
  `reuse_delay` int(10) unsigned NOT NULL DEFAULT '0',
  `buff_duration` int(10) unsigned NOT NULL DEFAULT '0',
  `type` varchar(45) NOT NULL DEFAULT '',
  `min_dmg` int(10) NOT NULL DEFAULT '0',
  `max_dmg` int(10) unsigned NOT NULL DEFAULT '0',
  `id` int(10) unsigned NOT NULL DEFAULT '0',
  `cast_gfx` int(10) unsigned NOT NULL DEFAULT '0',
  `range` int(10) unsigned NOT NULL DEFAULT '0',
  `lawful_consume` int(10) unsigned NOT NULL DEFAULT '0',
  `attr` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '属性',
  PRIMARY KEY (`skill_id`),
  KEY `idx_skill_name` (`name`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=10002 DEFAULT CHARSET=utf8 COMMENT='技能';

-- ----------------------------
-- Records 
-- ----------------------------
INSERT INTO `skill_list` VALUES ('1', '初級治癒術', '1', '0', 'pc', '4', '0', '0', '0', '0', '0', 'buff', '4', '14', '1', '744', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('2', '日光術', '1', '1', 'pc', '4', '0', '0', '0', '0', '1800', 'none', '1', '14', '2', '2510', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('3', '保護罩', '1', '2', 'pc', '3', '5', '0', '0', '0', '1800', 'none', '1', '1', '4', '221', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('4', '光箭', '1', '3', 'pc', '3', '0', '0', '0', '0', '0', 'attack', '1', '2', '8', '167', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('5', '指定傳送', '1', '4', 'pc', '5', '0', '0', '0', '0', '0', 'none', '1', '2', '16', '169', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('6', '解毒術', '2', '0', 'pc', '8', '0', '0', '0', '0', '0', 'buff', '2', '3', '1', '871', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('7', '寒冷戰慄', '2', '1', 'pc', '9', '1', '0', '0', '0', '0', 'attack', '2', '3', '2', '252', '0', '2', '0');
INSERT INTO `skill_list` VALUES ('8', '毒咒', '2', '2', 'pc', '10', '10', '0', '0', '0', '30', 'buff', '2', '3', '4', '745', '0', '50', '0');
INSERT INTO `skill_list` VALUES ('9', '擬似魔法武器', '2', '3', 'pc', '15', '0', '0', '0', '0', '1800', 'item', '2', '3', '8', '747', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('10', '無所遁形術', '2', '4', 'pc', '8', '0', '0', '0', '0', '0', 'none', '2', '3', '16', '749', '12', '0', '0');
INSERT INTO `skill_list` VALUES ('11', '極光雷電', '3', '0', 'pc', '14', '3', '0', '0', '0', '0', 'attack', '3', '4', '1', '170', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('12', '起死回生術', '3', '1', 'pc', '15', '0', '0', '0', '0', '0', 'buff', '3', '4', '2', '754', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('13', '中級治癒術', '3', '2', 'pc', '13', '0', '0', '0', '0', '0', 'buff', '24', '44', '4', '829', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('14', '闇盲咒術', '3', '3', 'pc', '17', '5', '0', '0', '0', '30', 'buff', '3', '4', '8', '746', '0', '80', '0');
INSERT INTO `skill_list` VALUES ('15', '鎧甲護持', '3', '4', 'pc', '20', '0', '0', '0', '0', '1800', 'item', '3', '3', '16', '748', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('16', '燃燒的火球', '4', '0', 'pc', '18', '0', '0', '0', '0', '0', 'attack', '4', '5', '1', '171', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('17', '通暢氣脈術', '4', '1', 'pc', '23', '0', '0', '0', '0', '1200', 'buff', '4', '5', '2', '750', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('18', '壞物術', '4', '2', 'pc', '26', '20', '508', '1', '0', '0', 'buff', '4', '5', '4', '172', '0', '200', '0');
INSERT INTO `skill_list` VALUES ('19', '吸血鬼之吻', '4', '3', 'pc', '15', '1', '0', '0', '0', '0', 'attack', '4', '5', '8', '236', '0', '1', '0');
INSERT INTO `skill_list` VALUES ('20', '緩速術', '4', '4', 'pc', '15', '10', '508', '1', '0', '64', 'buff', '4', '5', '16', '752', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('21', '木乃伊的詛咒', '5', '0', 'pc', '35', '30', '508', '2', '0', '30', 'buff', '5', '6', '1', '746', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('22', '極道落雷', '5', '1', 'pc', '23', '0', '0', '0', '0', '0', 'attack', '5', '6', '2', '10', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('23', '高級治癒術', '5', '2', 'pc', '20', '0', '0', '0', '0', '0', 'buff', '68', '98', '4', '830', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('24', '迷魅術', '5', '3', 'pc', '30', '20', '508', '2', '0', '3600', 'buff', '5', '6', '8', '228', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('25', '聖潔之光', '5', '4', 'pc', '20', '0', '0', '0', '0', '0', 'buff', '5', '6', '16', '227', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('26', '造屍術', '6', '0', 'pc', '35', '20', '508', '2', '0', '3600', 'buff', '6', '7', '1', '231', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('27', '體魄強健術', '6', '1', 'pc', '25', '15', '0', '0', '0', '1200', 'buff', '4', '5', '2', '751', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('28', '加速術', '6', '2', 'pc', '25', '20', '0', '0', '0', '1200', 'buff', '6', '7', '4', '755', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('29', '魔法相消術', '6', '3', 'pc', '35', '15', '508', '2', '0', '0', 'buff', '6', '7', '8', '232', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('30', '地裂術', '6', '4', 'pc', '20', '15', '0', '0', '0', '0', 'attack', '6', '7', '16', '129', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('31', '體力回復術', '7', '0', 'pc', '40', '60', '0', '0', '0', '0', 'none', '68', '98', '1', '759', '10', '0', '0');
INSERT INTO `skill_list` VALUES ('32', '冰矛圍籬', '7', '1', 'pc', '35', '8', '0', '0', '0', '20', 'attack', '7', '8', '2', '756', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('33', '召喚術', '7', '2', 'pc', '50', '30', '508', '3', '0', '3600', 'none', '7', '8', '4', '0', '0', '10', '0');
INSERT INTO `skill_list` VALUES ('34', '神聖的圓', '7', '3', 'pc', '45', '10', '0', '0', '0', '32', 'none', '7', '8', '8', '761', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('35', '龍捲風', '7', '4', 'pc', '40', '20', '0', '0', '0', '0', 'none', '7', '8', '16', '758', '4', '0', '0');
INSERT INTO `skill_list` VALUES ('36', '全部治癒術', '8', '0', 'pc', '48', '0', '0', '0', '0', '0', 'buff', '138', '168', '1', '831', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('37', '火牢', '8', '1', 'pc', '50', '20', '0', '0', '0', '10', 'buff', '8', '9', '2', '168', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('38', '冰雪暴', '8', '2', 'pc', '60', '10', '0', '0', '0', '0', 'none', '8', '9', '4', '757', '10', '10', '0');
INSERT INTO `skill_list` VALUES ('39', '隱身術', '8', '3', 'pc', '60', '60', '0', '0', '0', '1200', 'none', '8', '9', '8', '147', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('40', '返生術', '8', '4', 'pc', '50', '0', '0', '0', '0', '0', 'buff', '8', '9', '16', '3944', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('41', '力場', '9', '0', 'pc', '60', '20', '0', '0', '0', '0', 'attack', '9', '10', '1', '3924', '4', '0', '0');
INSERT INTO `skill_list` VALUES ('42', '沉睡之霧', '9', '1', 'pc', '60', '35', '0', '0', '0', '32', 'buff', '9', '10', '2', '760', '3', '0', '0');
INSERT INTO `skill_list` VALUES ('43', '變形術', '9', '2', 'pc', '60', '30', '0', '0', '0', '1000', 'buff', '9', '10', '4', '231', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('44', '聖結界', '9', '3', 'pc', '30', '0', '0', '0', '0', '32', 'buff', '9', '10', '8', '228', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('45', '集體傳送術', '9', '4', 'pc', '100', '20', '0', '0', '0', '0', 'none', '9', '10', '16', '2236', '10', '0', '0');
INSERT INTO `skill_list` VALUES ('46', '創造魔法武器', '10', '0', 'pc', '200', '100', '508', '10', '0', '0', 'item', '10', '11', '1', '763', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('47', '流星雨', '10', '1', 'pc', '70', '0', '0', '0', '0', '0', 'attack', '10', '12', '2', '762', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('48', '反射之池', '10', '2', 'pc', '100', '200', '508', '3', '0', '0', 'buff', '10', '11', '4', '233', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('49', '瞬間停止', '10', '3', 'pc', '80', '50', '508', '5', '0', '3840', 'buff', '10', '11', '8', '3932', '3', '0', '0');
INSERT INTO `skill_list` VALUES ('50', '究極光裂術', '10', '4', 'pc', '70', '10', '0', '0', '100', '0', 'attack', '10', '15', '16', '1815', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('129', '魔法防御', '17', '0', 'pc', '5', '0', '1822', '1', '100', '3600', 'none', '0', '0', '1', '2186', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('130', '心灵转换', '17', '1', 'pc', '0', '5', '0', '0', '400', '0', 'none', '1', '1', '2', '2179', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('131', '世界树的呼唤', '17', '2', 'pc', '5', '0', '0', '0', '100', '0', 'none', '0', '0', '4', '169', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('132', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('133', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('134', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('135', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('136', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('137', '净化精神', '18', '0', 'pc', '15', '0', '0', '0', '0', '1800', 'none', '0', '5', '1', '2180', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('138', '属性防御', '18', '1', 'pc', '10', '0', '0', '0', '0', '3600', 'none', '0', '10', '2', '2184', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('139', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('140', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('141', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('142', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('143', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('144', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('145', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('146', '魂体转换', '19', '1', 'pc', '0', '50', '0', '0', '1200', '0', 'none', '0', '0', '2', '2178', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('147', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('148', '火焰武器', '19', '3', 'pc', '10', '0', '0', '0', '0', '600', 'buff', '0', '0', '8', '2182', '0', '0', '2');
INSERT INTO `skill_list` VALUES ('149', '风之神射', '19', '4', 'pc', '20', '0', '0', '0', '0', '600', 'buff', '0', '0', '16', '2246', '0', '0', '8');
INSERT INTO `skill_list` VALUES ('150', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('151', '大地防护', '19', '6', 'pc', '10', '0', '0', '0', '0', '3600', 'buff', '0', '6', '64', '2249', '0', '0', '1');
INSERT INTO `skill_list` VALUES ('152', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('153', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('154', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('155', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('156', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('157', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('158', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('159', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('160', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('161', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('162', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('163', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('164', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('165', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('166', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('167', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('168', '', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', '', '0', '0', '0', '0', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('1000', '克特:地獄火', '0', '0', 'npc', '30', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '1812', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('1001', '死亡骑士:地獄火', '0', '0', 'npc', '30', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '245', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('1002', '伊弗利特-火矛', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '1776', '8', '0', '0');
INSERT INTO `skill_list` VALUES ('1003', '不死鸟-火焰雨', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '1793', '6', '0', '0');
INSERT INTO `skill_list` VALUES ('1004', '不死鸟-熔炎弹', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '1794', '8', '0', '0');
INSERT INTO `skill_list` VALUES ('1005', '巴拉卡斯-火焰喷吐', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '0', '3', '0', '0');
INSERT INTO `skill_list` VALUES ('1006', '巴拉卡斯-流星雨', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '0', '25', '0', '0');
INSERT INTO `skill_list` VALUES ('1007', '法利昂-寒冰喷吐', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '0', '3', '0', '0');
INSERT INTO `skill_list` VALUES ('1008', '法利昂-水压', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '0', '25', '0', '0');
INSERT INTO `skill_list` VALUES ('1009', '安塔瑞斯-剧毒喷吐', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '0', '3', '0', '0');
INSERT INTO `skill_list` VALUES ('1010', '安塔瑞斯-大地怒吼', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'none', '5', '10', '0', '0', '25', '0', '0');
INSERT INTO `skill_list` VALUES ('1011', '思克巴-妖女之吻', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '1115', '5', '0', '0');
INSERT INTO `skill_list` VALUES ('1012', '思克巴女皇-妖女之吻', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '1119', '5', '0', '0');
INSERT INTO `skill_list` VALUES ('1013', '烈炎兽吐火攻击', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '1783', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('1014', '加速术-怪物专用', '0', '0', 'npc', '5', '0', '0', '0', '0', '1200', 'buff', '5', '10', '0', '755', '12', '0', '0');
INSERT INTO `skill_list` VALUES ('1015', '地狱犬-喷火', '0', '0', 'npc', '5', '0', '0', '0', '0', '0', 'attack', '5', '10', '0', '954', '2', '0', '0');
INSERT INTO `skill_list` VALUES ('1016', '亚力安-冰矛围篱', '0', '0', 'npc', '5', '0', '0', '0', '0', '20', 'attack', '5', '10', '0', '2510', '0', '0', '0');
INSERT INTO `skill_list` VALUES ('10000', '禁言', '0', '0', 'pc', '0', '0', '0', '0', '0', '0', 'none', '0', '0', '0', '0', '0', '0', '0');
